"use strict";

const slp1_dict = {
    "क": "k", "ख": "K", "ग": "g", "घ": "G", "ङ": "N",
    "च": "c", "छ": "C", "ज": "j", "झ": "J", "ञ": "Y",
    "ट": "w", "ठ": "W", "ड": "q", "ढ": "Q", "ण": "R",
    "त": "t", "थ": "T", "द": "d", "ध": "D", "न": "n",
    "प": "p", "फ": "P", "ब": "b", "भ": "B", "म": "m",
    "य": "y", "र": "r", "ल": "l", "व": "v", 
    "श": "S", "ष": "z", "स": "s", "ह": "h",
    "अ": "a", "आ": "A", "इ": "i", "ई": "I", "उ": "u", "ऊ": "U",
    "ऋ": "f", "ॠ": "F", "ऌ": "x", "ॡ": "X",
    "ए": "e", "ऐ": "E", "ओ": "o", "औ": "O",
    'ं': 'M', 'ः': 'H', "ा": "A", "ि": "i", "ी": "I", "ु": "u",
    "ू": "U", "ृ": "f", "ॄ": "F", "ॢ": "x", "ॣ": "X", 
    "े": "e", "ै": "E", "ो": "o", "ौ": "O",
    "ऽ": "'", " ": " "
};

const consonants_dev = new Set(['क','ख','ग','घ','ङ','च','छ','ज','झ','ञ','ट','ठ','ड','ढ','ण','त','थ','द','ध','न','प','फ','ब','भ','म','य','र','ल','व','श','ष','स','ह']);
const matras_dev = new Set(["ा","ि","ी","ु","ू","ृ","ॄ","ॢ","ॣ","े","ै","ो","ौ"]);

function dev2slp1(st) {
    let transstr = "";
    for (let i = 0; i < st.length; i++) {
        let ch = st[i];
        let nextCh = st[i + 1];

        if (ch === '्') continue;

        transstr += slp1_dict[ch] || ch;

        if (consonants_dev.has(ch)) {
            if (nextCh !== '्' && !matras_dev.has(nextCh)) {
                transstr += "a";
            }
        }
    }
    return transstr;
}